{"pages":[],"posts":[{"title":"比赛1","text":"摘要内容 湖南省第十二届“海盟客机杯”大学生计算机程序设计竞赛———应用开发类竞赛移动终端类项目名称:余香 作者: IHT比赛组 这是一个手机APP项目。该APP分为五大部分，第一大部分是任务地图，用户可以查看周边任务，发布任务，接收任务，查看个人任务状态。第二大部分是聊天通讯，包括通讯录和一键呼叫。剩下的三大部分是个人任务管理，个人信息管理，个性任务推送。我觉得这个APP最有意思的地方就是摇一摇手机，然后可以进入周边的地图，在地图上，你可以查看周围的许多任务，你可以选择你想接的任务，做完之后，你就可以获得相应的赏金，特别有成就感。使用这个APP，一方面通过顺手相助或者利用自己闲散的时间帮助他人做一件小事，使得懒人变得勤快起来，另一方面，增加了邻里，同学之间和谐友爱的关系，使整个社会人与人之间变得不再冷漠。 首先作为一个学弟吧，我觉得学长学姐们已经做的很棒了，认真看下来，我们真的是能从中得一定的经验体会的： ①104页系统设计的说明书详细的带我们走进了这部软件的“出生“和”成人“，总所周知，一个成熟软件的成型需要走过需求分析，概要设计，详细设计，开发测试四大阶段。而系统设计说明书则详细带我们进行了了解，不过能有一个面向普通人员更简单明了的说明书就好了 ②PPT和视频的制作也很精良，不过据非正业人士反应，并不知道在干什么，还有觉得吸引力不够强，不能一下留住“试探者”的心。 ③个人的一些想法：对老年人可以更“友善”一点，针对老年人对智能设备的掌握程度不够高这一现实，我觉得有必要对老年社区进一步简单化，可以只要一些版块，老年人只要点就可以了；在面对年轻人时也要在显示高端的同时显示便捷，应该以突出的点吸引青年朋友的目光，简单便捷的告诉他们这款软件的长处以吸引客源 ④盈利模式不太清晰，搞不大懂，还有个人觉得应该突出这个产品的价值，而不是一味的平铺直述，尤其对于要招商广告来说，更要突出特点与价值 第一次接触这个，对这个软件也没有深层次的理解，相关问题学姐学长可能早就相关并解决好了而我也不知道。因此我仅是以我微末的道行提出了一些浅见，如果有说的不好的地方，欢迎批评指正。 随着人们的各种需求的诞生，相对应的移动端服务软件也随之诞生，而它们只能在单一服务上为人们解决单一的问题，如外卖APP能为人们解决点餐服务，而送餐却需要增加另外的成本；快递能快速的传递物品，却要人们定点定时取得物品。面对诸如此类的问题，假使我能够顺便帮助他人完成这件小事，并将此次服务的价值储存起来，以备下次他人能够顺便为我提供一件同等价值的服务。基于此理念，我们打造了APP余香，在生活服务方面为人提供一个服务交换的平台，一方面通过顺手相助或者利用自己闲散的时间帮助他人做一件事，使得“懒人”变得勤快起来；另一方面，增加了邻里、同学之间和谐有爱的关系，使整个社会人与人之间变得不再冷漠。 1.1目标 余香APP为志在生活服务中提供一个服务交换平台人们可以用自己的闲暇时间去帮别人做某件事，这样既方便他人，也充分利用自己闲暇时间。余香APP需要提供基于地理位置信息的服务发布，服务检索功能；个性化任务推送功能，智能快捷的将最合适的任务推送给任务附近的人；通讯交流功能，任务接收者和发布者可以方便快捷沟通任务细节。 1.2术语 任务：任务可以是一件事，比如买某样东西或者去图书馆占个座。 香金：香金是具有价值尺度、支付手段、流通手段职能的线上虚拟货币。香金是一种法定的虚拟货币，但不等同于法定货币。它在以服务银行为媒介，由提供服务交换平台的互联网运营商发布，在人们服务交换的过程中充当一般等价物的特殊商品。 服务银行：服务银行是线上服务价值管理机构，具有储存、兑换服务价值的职能。在互联网时代的今天，人际间的交流越来越便捷，基于服务业的飞速发展，服务作为一种有价值的活动也需要将它兑换成能够流通的一般等价物，作为一种商品相互交换。 服务换服务：服务换服务是指用户之间以服务银行为媒介，通过服务银行中的虚拟货币服务币，提供或获取服务的过程。其流程为：服务需求者先对服务需求与其他条件进行描述，将其投入服务池中进行排队，当满足条件的服务提供者提出申请后，他的申请将进入服务发起人的提供者队列中，按照优先等级向服务发起者进行推送。随后双方相互洽谈服务细节、服务价值等，最终完成服务交换的过程。我们所说的服务一般是指为他人做事，并使他人从中受益的活动。而在服务交换的过程中，服务提供者不一定能够当即获得报酬，而是将服务的价值通过服务币的形式储存在服务银行中，以适时等价地换取其他服务。 2.1任务概述 发布任务：用户发布一个包含地理位置信息的服务，任务将会显示在任务地图上可被人接收。 接收任务：用户在任务地图上看到想去完成的任务，任务被接收后才可被完成。 拨号：在主界面，设置拨号按钮，当用户偶遇紧急情况，可点击拨号迅速拨通预存号码 接收任务：用户确定要去完成某任务，先得接收任务，将任务纳入自己的未完成任务列表，已被接收的任务不能别别人接收，处于锁定状态。 完成任务：接收任务者完成了任务向系统提交任务完成，由任务发布人审核任务任务是否被完成，再由任务发布人确定任务是否已被完成。 个性任务推送：系统会自动根据当前用户的经纬度坐标从当前可接收任务中智能挑选出一条用户最可能会去做的任务给用户 2.2系统（或用户）的特点 本系统的用户为普通安卓手机用户，手机能够进行网络或者GPS定位，系统特色为结合地理位置信息的服务交换平台。 2.3.假定和约束开发期限为一学年。 2.4.需求规定本系统是余香网络服务交换平台。参与者包括：注册用户。他们的用例如下： 2.5.注册用户注册用户：摇一摇、查看任务地图、发布任务、接收任务、个人信息管理、查看任务状态、通讯社交； 2.6.推送系统推送系统：个性任务推送 3.详细功能介绍 3.1发布任务用户首先通过摇一摇进入任务地图界面，地图界面右下角设有分把人物按钮，用户点击按钮即可发布人物界面，用户需要填写必要任务信息即可。 3.2查看任务状态用户查看当前发布或者接收的任务完成情况，任务分为发布且已完成，发布未完成，接收已完成，接收未完成四个状态。 5.4接收任务（SRS_case4） 用户在任务地图点击任务发布人头像进入任务详细界面，接收任务只能接收未被接收的任务，点击已被接收的任务会被提醒下次早点来抢任务。接收任务活动图如下： 4运行环境规定 4.1设备及分布 服务器类型：LeanCloud云服务 网络类型：广域网 存储容量：存储容量根据需求云服务器会弹性给予，理论上讲存储不限，超出一定额度需支付额外费用即可。 下面是app界面:","link":"/2019/05/25/1比赛(2)/"},{"title":"如何上传oj题","text":"摘要内容 如何上传oj题 作者: RE9T 目录 前言 实际操作 关于如何上传oj题目，我这里做一个小总结 前提 看什么前提？？？，前提不是你是oj管理员吗？ 实际操作 首先进入OJ的后台管理页面。然后选择问题部分的增加题目 然后剩下的部分自己填完，一直到测试类型部分在输入样例的上方有一个tag，请将它改为自己的代号或者名字，方便查看 这部分很重要，因为测试输入输出文件需要自行编写，测试数据很重要，本片重点就是如何编写测试输入输出文件。 .in文件为测试输入文件，注意：请按照顺序写，比如果只有1个输入文件，文件名为1.in,多个文件则按顺序2.in,3.in .out文件为测试输出文件，编写规则与上同。 最后将其放在一起，进行压缩。注意，压缩只能压缩纯粹的in，out文件然后点击下面的部分上传压缩文件就ok了 具体可以参考oj文档","link":"/2019/05/11/如何上传oj题/"},{"title":"如何恢复静态hexo","text":"摘要内容 如何恢复静态hexo 作者: RE9T 目录 如何将本地hexo备份上github 如何重新恢复本地博客 如何将本地hexo备份上github 前提：已经配置密匙且上传过hexo静态页面 1$ git clone \"远程仓库地址\" 先将远程仓库克隆到本地， 然后进入clone的目录，打开git bash 1$ git checkout -b hexo 创建并切换成hexo目录 然后将本地博客内的东西全部复制到该目录中 然后删除theme目录下的所有.git文件 1$ git add --all 该命令将所有文件加入缓存区 1$ git commit \"源代码\" 该命令将文件添加 自述内容 1$ git push origin hexo 推送至远程仓库 如何重新恢复本地博客 前提：已下载git和nodejs 和绑定密匙 先找一个文件用来准备存放需要克隆的文件 在该目录下打开git bash界面 1$ git clone -b hexo \"远程仓库地址\" 然后打开该文件，输入 1npm install hexo --save 然后就完成了，接下来操作与正常hexo上传相似，建议以后每次操作为（前提是如果在本地预览后没有问题，）。 12345$ git pull$ hexo d -g$ git add -all$ git commit -m \"代码自述\"$ git push -u origin hexo","link":"/2019/05/11/如何恢复静态hexo/"},{"title":"如何配置github项目密匙","text":"摘要内容 如何配置github项目密匙 作者: RE9T 目录 前言 具体操作 添加公匙 前言 在此之前需要先要拥有一个自己的GitHub账号;以及已经安装了git工具 具体操作 首先找到自己的./ssh文件（有些可能找不到那也也是正常的，因为.ssh文件并不是初始化系统必虚的，该目录用于保存生成过的密匙匙，随便找个地方打开git bash，执行下面操作也有效） 右击.ssh文件夹打开git bash窗口，在打开的git bash窗口里，输入下面信息 1$ ssh-keygen -t rsa -C \"youemail\" 解释一下，youemail需要换成自己的注册GitHub账号的邮箱;然后在第一个提示句输入自己的github用户名_rsa ;(可以换成其他的，这个用户名以后就是你的登陆句柄 ) 这个时候.ssh文件就已经建立了，在c盘的用户下面可以找到它，然后在这个文件里面打开git bash窗口（已经到打开过了可以跳过） 然后继续在窗口内输入（一定要检查路径是不是在.ssh下，不然会很麻烦，ps-不堪回首）然后输入下面这句 1$ touch coufig 然后打开coufig文件输入以下内容，注意不要在语句前加缩进和空格（ps-不堪回首）下面的one用于代替我的用户名 123456# oneHost one.github.comHostName github.comPreferredAuthentications publickeyIdentityFile ~/.ssh/one_rsaUser one 注意不要改动 （详细参考博客) 前面弄完，并且已经保存后，执行下一步操作。 添加公匙 打开自己的github账号，并且在设置里面的ssh里面添加ssh，密匙名字随便写，内容就要在.ssh文件里面找到自己建立的–比如我的是one_rsa.pub，将里面的内容复制到上面就行 然后就是最后一步，测试 1$ssh -T git@one.github.com 注意，我上面的one仅是样例，可以更改，可以与多个github绑定，设置不同的句柄，每个新账号的添加步骤一致。 如果不知道.ssh路径在哪的 请参考大佬博客","link":"/2019/05/11/如何配置github项目密匙/"},{"title":"团队标准文档","text":"摘要文章主要内容 内容: 标准定制文件 作者: iht 目录 前言 团队内文件交流文件。 文件上传流程 OJ管理文件 团队日志记录 前言IHT团队管理必须文件上传名字命名的规范性，文件使用的通用性，以保证大家的协调工作，所有标准化规范必须严格遵循。望各位成员悉知。 团队内文件交流文件IHT 团队内部用来传播的文件，全部都必须使用markdown语法的 .md 文件 文件上传流程首先查看自己的文档是否已经分类，或被要求交到什么文件夹下 如果已要求上交的文件夹，请务必遵循 如果没有，请自行建立文件夹进行分类，再上传 文件夹命名规则123年-月-日-文件夹名eg: 2019-4-23-IHT团队核心文件 个人文件命名规则123年-月-日-时-分-名字-文件名eg: 2019-4-23-15-44-李超-规范文件 OJ管理文件OJ上传题目 tag标签必须加个人代号（或者名字就行，能证明是你就好） OJ题目改动 确定改动原因 确认无误后上传 团队日志记录","link":"/2019/04/23/标准文档/"},{"title":"团队md标准样式","text":"摘要内容 例如:关于团队md的标准样式 作者: IHT BLOG TEAM（自行更改） 目录 tags标签分类 更多….. tags标签分类 Team_template 团队模板类 Technology 技术文档类 Competition_information 比赛资料介绍类 额外部分12&lt;!-- more --&gt;以下部分为主要内容，内容格式自主选择。但more前面格式必须统一","link":"/2019/05/11/标准样式/"}],"tags":[{"name":"Competition_information","slug":"Competition-information","link":"/tags/Competition-information/"},{"name":"Technology","slug":"Technology","link":"/tags/Technology/"},{"name":"Team_template","slug":"Team-template","link":"/tags/Team-template/"}],"categories":[]}